In [1]:
import numpy as np
import pandas as pd

# DataFrames

bunch of Series objects having a common index

In [2]:
from numpy.random import randn
np.random.seed(50)

In [3]:
df = pd.DataFrame(randn(5,4),
                  index = 'A B C D E'.split(),
                  columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

# Selection and Indexing

### Selecting Columns

In [4]:
df['Y']

A   -0.620928
B   -0.780469
C    0.126338
D   -0.997526
E    0.123866
Name: Y, dtype: float64

In [5]:
type(df['Y'])

pandas.core.series.Series

In [6]:
#SQL Syntax (Not recommended)

df.Y

A   -0.620928
B   -0.780469
C    0.126338
D   -0.997526
E    0.123866
Name: Y, dtype: float64

In [7]:
df[['W','Z']]

          W         Z
A -1.560352 -1.464580
B  1.411946  1.070268
C -1.282293  0.862194
D  0.696737  1.598908
E  3.314075  0.742785

In [8]:
df['new'] = df['W']+df['Y']

In [9]:
df

          W         X         Y         Z       new
A -1.560352 -0.030978 -0.620928 -1.464580 -2.181281
B  1.411946 -0.476732 -0.780469  1.070268  0.631477
C -1.282293 -1.327479  0.126338  0.862194 -1.155955
D  0.696737 -0.334565 -0.997526  1.598908 -0.300789
E  3.314075  0.987770  0.123866  0.742785  3.437942

In [10]:
#removing columns
df.drop('new',axis = 1)

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [11]:
df

          W         X         Y         Z       new
A -1.560352 -0.030978 -0.620928 -1.464580 -2.181281
B  1.411946 -0.476732 -0.780469  1.070268  0.631477
C -1.282293 -1.327479  0.126338  0.862194 -1.155955
D  0.696737 -0.334565 -0.997526  1.598908 -0.300789
E  3.314075  0.987770  0.123866  0.742785  3.437942

In [12]:
#method1 for removing column permanently
df1 = df.drop('new',axis = 1)

In [13]:
df1

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [14]:
df

          W         X         Y         Z       new
A -1.560352 -0.030978 -0.620928 -1.464580 -2.181281
B  1.411946 -0.476732 -0.780469  1.070268  0.631477
C -1.282293 -1.327479  0.126338  0.862194 -1.155955
D  0.696737 -0.334565 -0.997526  1.598908 -0.300789
E  3.314075  0.987770  0.123866  0.742785  3.437942

In [15]:
#method2
df.drop('new',axis = 1, inplace=True)

In [16]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [17]:
df.drop('E',axis=0)

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908

In [18]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

### Selecting Rows

In [19]:
df.loc['B']  #loc for location

W    1.411946
X   -0.476732
Y   -0.780469
Z    1.070268
Name: B, dtype: float64

In [20]:
df.iloc[0] #iloc for index location

W   -1.560352
X   -0.030978
Y   -0.620928
Z   -1.464580
Name: A, dtype: float64

In [21]:
## selecting subset of rows and columns

df.loc['D','Y']

-0.9975260642855341

In [22]:
df.loc[['B','C'],['X','Z']]

          X         Z
B -0.476732  1.070268
C -1.327479  0.862194

In [23]:
df.iloc[[-5,2],[2,3]]

          Y         Z
A -0.620928 -1.464580
C  0.126338  0.862194

# Conditional Selection

In [24]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [25]:
df>0

       W      X      Y      Z
A  False  False  False  False
B   True  False  False   True
C  False  False   True   True
D   True  False  False   True
E   True   True   True   True

In [26]:
df[df>0]  #not common to use

          W        X         Y         Z
A       NaN      NaN       NaN       NaN
B  1.411946      NaN       NaN  1.070268
C       NaN      NaN  0.126338  0.862194
D  0.696737      NaN       NaN  1.598908
E  3.314075  0.98777  0.123866  0.742785

In [27]:
df['X']>0

A    False
B    False
C    False
D    False
E     True
Name: X, dtype: bool

In [28]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [29]:
df[df['X']>0]

          W        X         Y         Z
E  3.314075  0.98777  0.123866  0.742785

In [30]:
df[(df['W']>0) & (df['Y']>0) ]

          W        X         Y         Z
E  3.314075  0.98777  0.123866  0.742785

In [31]:
df[(df['W']>0) | (df['Y']>0) ]

          W         X         Y         Z
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

# More Index Concepts:

In [33]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [34]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.560352 -0.030978 -0.620928 -1.464580
1     B  1.411946 -0.476732 -0.780469  1.070268
2     C -1.282293 -1.327479  0.126338  0.862194
3     D  0.696737 -0.334565 -0.997526  1.598908
4     E  3.314075  0.987770  0.123866  0.742785

In [35]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [36]:
df.reset_index(inplace=True)

In [37]:
df

  index         W         X         Y         Z
0     A -1.560352 -0.030978 -0.620928 -1.464580
1     B  1.411946 -0.476732 -0.780469  1.070268
2     C -1.282293 -1.327479  0.126338  0.862194
3     D  0.696737 -0.334565 -0.997526  1.598908
4     E  3.314075  0.987770  0.123866  0.742785

# Setting Index

In [39]:
st = 'TN MP WB UP GJ'.split()

In [43]:
df['states'] = st

#df['states'] = 'TN MP WB UP GJ'.split()

In [44]:
df

  index         W         X         Y         Z states
0     A -1.560352 -0.030978 -0.620928 -1.464580     TN
1     B  1.411946 -0.476732 -0.780469  1.070268     MP
2     C -1.282293 -1.327479  0.126338  0.862194     WB
3     D  0.696737 -0.334565 -0.997526  1.598908     UP
4     E  3.314075  0.987770  0.123866  0.742785     GJ

In [45]:
df.set_index('states')

       index         W         X         Y         Z
states
TN         A -1.560352 -0.030978 -0.620928 -1.464580
MP         B  1.411946 -0.476732 -0.780469  1.070268
WB         C -1.282293 -1.327479  0.126338  0.862194
UP         D  0.696737 -0.334565 -0.997526  1.598908
GJ         E  3.314075  0.987770  0.123866  0.742785

In [46]:
df

  index         W         X         Y         Z states
0     A -1.560352 -0.030978 -0.620928 -1.464580     TN
1     B  1.411946 -0.476732 -0.780469  1.070268     MP
2     C -1.282293 -1.327479  0.126338  0.862194     WB
3     D  0.696737 -0.334565 -0.997526  1.598908     UP
4     E  3.314075  0.987770  0.123866  0.742785     GJ

In [47]:
df.set_index('states',inplace=True)

In [48]:
df

       index         W         X         Y         Z
states
TN         A -1.560352 -0.030978 -0.620928 -1.464580
MP         B  1.411946 -0.476732 -0.780469  1.070268
WB         C -1.282293 -1.327479  0.126338  0.862194
UP         D  0.696737 -0.334565 -0.997526  1.598908
GJ         E  3.314075  0.987770  0.123866  0.742785

# Multi-Index and Index Hierarchy

In [72]:
outside = 'A1 A1 A1 A2 A2 A2'.split()
inside = [11,12,13,11,12,13]

hier_index = list(zip(outside,inside))

hier_index = pd.MultiIndex.from_tuples(hier_index)

In [73]:
list(zip(outside,inside))

[('A1', 11), ('A1', 12), ('A1', 13), ('A2', 11), ('A2', 12), ('A2', 13)]

In [74]:
hier_index

MultiIndex([('A1', 11),
            ('A1', 12),
            ('A1', 13),
            ('A2', 11),
            ('A2', 12),
            ('A2', 13)],
           )

In [75]:
df = pd.DataFrame(index=hier_index, data = np.random.randn(6,2), columns=['X','Y'])
df

              X         Y
A1 11 -0.890955 -0.270646
   12  0.222244  0.251814
   13  0.707926  0.493990
A2 11  1.471002 -0.582619
   12  2.065819  1.087834
   13  0.805189 -1.587885

In [76]:
df.loc['A1']

           X         Y
11 -0.890955 -0.270646
12  0.222244  0.251814
13  0.707926  0.493990

In [77]:
df.loc['A1'].loc[12,'Y']

0.25181359710998347

In [78]:
df.index.names

FrozenList([None, None])

In [79]:
df.index.names = ['Group','Roll No']

In [80]:
df

                      X         Y
Group Roll No
A1    11      -0.890955 -0.270646
      12       0.222244  0.251814
      13       0.707926  0.493990
A2    11       1.471002 -0.582619
      12       2.065819  1.087834
      13       0.805189 -1.587885